// ===========================Тернарный оператор=============================
const total = 100;
const order = 50;
const category =
  order > total
    ? '"На складе не достаточно товаров!"'
    : '"Заказ оформлен, с вами свяжется менеджер"';

console.log(category);

// ========================= Операторы ветвления if/else  ==========================
// const total = 100;
// const order = 50;
// if (order > total){
//     console.log('"На складе не достаточно товаров!"');
// } else {
//     console.log('"Заказ оформлен, с вами свяжется менеджер"');
// }
